stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
/*

 This file is part of the OOBD.org distribution.

 OOBD.org is free software; you can redistribute it and/or modify it
 under the terms of the GNU General Public License (version 2) as published
 by the Free Software Foundation and modified by the FreeRTOS exception.

 OOBD.org is distributed in the hope that it will be useful, but WITHOUT
 ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for
 more details.

 You should have received a copy of the GNU General Public License along
 with FreeRTOS.org; if not, write to the Free Software Foundation, Inc., 59
 Temple Place, Suite 330, Boston, MA  02111-1307  USA.


 OOBD C source files requirement:
 Unix EOL file format
 UTF-8
 formated with "indent -kr"

 Please ensure to read the configuration and relevant port sections of the
 online documentation.


 OOBD is using FreeRTOS (www.FreeRTOS.org)

 */

/* Includes ------------------------------------------------------------------*/
#include "FreeRTOSConfig.h"
#include "stm32f10x.h"
#include "SystemConfig.h"
#include "od_config.h"
#include "mc_serial.h"
#include "odp_uds.h"
#include "odb_can.h"

/* -------- Used Global variables --------------------------------------------*/

uint8_t BTM222_BtAddress[18] = "00:00:00:00:00:00";

uint8_t BTM222_DeviceName[17] = "not detected";

unsigned char BTM222_UartSpeed;

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
DMA_InitTypeDef sEEDMA_InitStructure;

/* Private function prototypes -----------------------------------------------*/

/* Private functions ---------------------------------------------------------*/

/**
 * @brief  Configures the system.
 * @param None.
 * @retval : None.
 */
void System_Configuration(void) {

	/* GPIO configuration */
	GPIO_Configuration();

	/* USART1 configuration */
	USART1_Configuration();

	/* USART1 configuration */
	//    USART2_Configuration();

	/* USART1 configuration */
	CAN1_Configuration(VALUE_BUS_CONFIG_11bit_500kbit, CAN_Mode_Silent); /* default initialization */

	/* Analog digitial converter configuration */
	ADC_Configuration();

	if (GPIO_HardwareLevel() == 4)
		/* Timer 2 configuration for PWM output, 3100Hz/50% duty cycle */
		TIM2_Configuration(3100); /* OOBD-Cup v5 only */
	else if (GPIO_HardwareLevel() == 5)
		/* Timer 3 configuration for PWM output, 3100Hz/50% duty cycle */
		TIM3_Configuration(3100); /* OOBD CAN Invader only */

	/* NVIC configuration */
	//  NVIC_Configuration();

	// move to hardware init function as well as LEDTask
	//xQueueCreate = xQueueCreate (2, sizeof (boolean));
	extern QueueHandle_t Led1Queue;

	extern QueueHandle_t Led2Queue;

}

/*----------------------------------------------------------------------------*/
/**
 * @brief  Configure the nested vectored interrupt controller
 * @param  None
 * @retval None
 */
void NVIC_Configuration(void) {
	NVIC_InitTypeDef NVIC_InitStructure;

	/* Set the Vector Table base location to FLASH */
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x2500);

	/* Setting the priority grouping bits length */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

	/* Enable the USART1 Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;

	/* NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0; */
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
			= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	/* Enable CAN1 interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority
			= (configMAX_SYSCALL_INTERRUPT_PRIORITY >> 4) + 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	NVIC_InitStructure.NVIC_IRQChannel = I2C1_EV_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	NVIC_InitStructure.NVIC_IRQChannel = I2C1_ER_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);
}

/*----------------------------------------------------------------------------*/
/**
 * @brief  returns peripherals hardware ID
 * @param  None
 * @retval 1 = standard DXM, 4 = OOBD D2-V5, 5 = OOBD CAN Invader
 */UBaseType_t GPIO_HardwareLevel(void) {
	UBaseType_t HardwareVariant = 0; /* default no valid hardware detected */

	if ((GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) == Bit_SET)
			&& (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) == Bit_SET)
			&& (GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14) == Bit_SET))
		HardwareVariant = 1; /* DXM1 */
	else if ((GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) == Bit_RESET)
			&& (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) == Bit_SET))
		//              (GPIO_ReadInputDataBit(GPIOC, GPIO_Pin_14) == Bit_RESET))
		HardwareVariant = 4; /* OOBD-Cup v5 */
	else if ((GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_8) == Bit_SET)
			&& (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_13) == Bit_SET)
			&& (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_14) == Bit_RESET))
		HardwareVariant = 5; /* OOBD CAN Invader */

	return HardwareVariant;
}

/*----------------------------------------------------------------------------*/
/**
 * @brief  Configures the different GPIO ports
 * @param  None
 * @retval None
 */
void GPIO_Configuration(void) {

	GPIO_InitTypeDef GPIO_InitStructure;

	/* release alternative GPIO function of PA13/14/15 and PB4 */
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_Disable, ENABLE);

