stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
	/* GPIOx clocks enable */
	RCC_APB2PeriphClockCmd(
			RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB | RCC_APB2Periph_GPIOC
					| RCC_APB2Periph_AFIO, ENABLE);

	/* Configure all unused GPIO port pins in Analog Input mode (floating input
	 trigger OFF), this will reduce the power consumption and increase the
	 device immunity against EMI/EMC ***************************************** */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_All;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;

	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/** --------------------------------------------------------------------------
	 * PORTA configuration
	 * PA 0 =              	  = GPIO_Mode_AIN - Input floating for low power consumption
	 * PA 1 = ???             = GPIO_Mode_AIN - Input floating for low power consumption
	 * PA 2 = USART2_Tx 	  = GPIO_Mode_AF_PP - Alternate Function output Push Pull (L9637D RX, Pin1)
	 * PA 3 = USART2_Rx 	  = GPIO_Mode_AIN - Input floating for low power consumption (L9637D TX, Pin4)
	 * PA 4 = L-LINE Output   = GPIO_Mode_Out_PP - Output Push Pull
	 * PA 5 = ???             = GPIO_Mode_AIN - Input floating for low power consumption
	 * PA 6 = LM393 Out, Pin1 = GPIO_Mode_AIN - currently unused
	 * PA 7 = LM393 Out, Pin7 = GPIO_Mode_AIN - currently unused
	 * --------------------------------------------------------------------------
	 * PA 8 = DXM1 IO Pin 21  = GPIO_Mode_AIN - OOBD-Cup v5 hardware identification
	 * PA 9 = USART1_Tx       = GPIO_Mode_AF_PP - Alternate Function output Push Pull
	 * PA10 = USART1_Rx       = GPIO_Mode_AIN - Input floating for low power consumption
	 * PA11 = USART1_CTS      = GPIO_Mode_AIN - CAN-RxD for STM32F103T8 (i.e. OOBD CAN Invader)
	 * PA12 = USART1_RTS      = GPIO_Mode_AIN - CAN-TxD for STM32F103T8 (i.e. OOBD CAN Invader)
	 * PA13 = HardwareIdent   = GPIO_Mode_AIN - OOBD CAN Invader hardware identification
	 * PA14 = HardwareIdent   = GPIO_Mode_AIN - OOBD CAN Invader hardware identification
	 * PA15 = ???             = GPIO_Mode_AIN - Input floating for low power consumption
	 * --------------------------------------------------------------------------
	 */

	/* Enable USART1 Clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);

	/* General settings for GPIOs of PORT A */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	/* Initialize USART2 on PA2 (USART2_Tx) and PA3 (USART2_Rx) for K-Line interface */
	//    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_ResetBits(GPIOA, GPIO_Pin_2);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* configure L-Line output */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	GPIO_ResetBits(GPIOA, GPIO_Pin_4);

	/* configure PA8, PA13, PA14 as Input for Hardwareidentifikaton
	 * PA8 & PA13 & PA14 = 1 - Original DXM1
	 * PA8 = 0, PA13 & PA14 = 1 - OOBD-Cup v5
	 */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* Initialize USART1 on PA9 (USART1_Tx) and PA10 (USART1_Rx) for RS232 interface */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/** --------------------------------------------------------------------------
	 * PB 0 = ADC12_IN8 = GPIO_Mode_AIN - Input floating for low power consumption
	 * PB 1 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
	 * PB 2 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
	 * PB 3 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
	 * PB 4 = DXM1 IO Pin 13, LED2 - red = GPIO_Mode_Out_OD - Output open drain
	 *        OOBD-Cup v5 Duo-LED2 - red
	 * PB 5 = DXM1 IO Pin 12, LED1 - green = GPIO_Mode_Out_OD - Output open drain
	 * 		  OOBD-Cup v5 Duo-LED2 - green
	 * PB 6 = 24LC16, SCL = GPIO_Mode_AF_OD = Alternate Function output open drain
	 * PB 7 = 24LC16, SDA = GPIO_Mode_AF_OD = Alternate Function output open drain
	 * --------------------------------------------------------------------------
	 * PB 8 = TJA1050 Pin 4 (RxD)  = GPIO_Mode_IPU - Input Pullup
	 * PB 9 = TJA1050 Pin 1 (TxD)  = GPIO_Mode_AF_PP - Alternate Function output Push Pull
	 * PB10 = DXM1 IO Pin 15, LCD out  = GPIO_Mode_AIN - currently unused
	 * 		  OOBD-Cup v5 LED1 - yellow
	 * PB11 = DXM1 IO Pin 18, A0 out   = GPIO_Mode_AIN - currently unused
	 *        OOBD-Cup v5 PWM out for buzzer = GPIO_Mode_AF_PP - Output Push Pull
	 * PB12 = DXM1 IO Pin 19, SPI_CS   = GPIO_Mode_AIN - currently unused
	 * PB13 = DXM1 IO Pin 20, SPI_SCK  = GPIO_Mode_AIN - currently unused
	 * PB14 = DXM1 IO Pin 22, SPI_MISO = GPIO_Mode_AIN - currently unused
	 * PB15 = DXM1 IO Pin 23, SPI_MOSI = GPIO_Mode_AIN - currently unused
	 *---------------------------------------------------------------------------
	 */

	/* General settings for GPIOs of PORT B */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	/* Configure I2C pins: SCL and SDA ---------------------------------------- */
	//  GPIO_InitStructure.GPIO_Pin   = GPIO_Pin_6 | GPIO_Pin_7;
	//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//  GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_OD;
	//  GPIO_Init(GPIOB, &GPIO_InitStructure);

	/** --------------------------------------------------------------------------
	 * PC13 = ??? = GPIO_Mode_AIN - Input floating for low power consumption
	 * PC14 = DXM1 IO Pin 29 = GPIO_Mode_AIN - currently unused
	 * PC15 = DXM1 IO Pin 28 = GPIO_Mode_AIN - currently unused
	 *        OOBD-Cup v5    = GPIO_Mode_Out_PP - Plush-Pull, REL1
	 * --------------------------------------------------------------------------
	 */

