stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
	/* General settings for GPIOs of PORT C */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	/* configure PC14 as Input for Hardwareidentifikaton
	 * PC14 = 1 - Reserved for further variants of OOBD-Cup v5 (default)
	 * PC14 = 0 - Reserved for further variants of OOBD-Cup v5
	 */
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	/** --------------------------------------------------------------------------
	 * Port specific configuration depending on hardware ident
	 * --------------------------------------------------------------------------
	 */

	/* General settings for GPIO_Speed */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;

	/* CAN-Relay switching depending on hardware ident */
	if (GPIO_HardwareLevel() == 4) { /* OOBD-Cup v5 */
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
		/* initialize new PortC settings  */
		GPIO_Init(GPIOC, &GPIO_InitStructure);
		GPIO_ResetBits(GPIOC, GPIO_Pin_15); /* default: REL1 - OFF */
	} else if (GPIO_HardwareLevel() == 5) { /* OOBD CAN Invader */
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
		/* initialize new PortB settings  */
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		GPIO_ResetBits(GPIOB, GPIO_Pin_3); /* default PB3: REL1 - OFF */
	}

	/* LED configuration depending on hardware ident */
	if (GPIO_HardwareLevel() == 4) { /* OOBD-Cup v5 or OOBD-Cup v5 */
		/* configure DXM1-Output (push pull) of Duo-LED2 - green (PB5) and LED2 - red (PB4)
		 * and LED2 - blue (PB10) */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_10;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
	} else if (GPIO_HardwareLevel() == 5) { /* OOBD CAN Invader */
		/* configure of Duo-LED - green (PB5) and LED2 - red (PB4) */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(GPIOB, &GPIO_InitStructure);

		/* configure of LED2 - blue (PA7) */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
	} else if (GPIO_HardwareLevel() == 1) { /* Original DXM1 */
		/* configure DXM1-Output (open drain) of LED1 - green (PB5) and LED2 - red (PB4) */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
	}

	/* configure of BT-Module reset */
	if (GPIO_HardwareLevel() == 4) { /* OOBD-Cup v5 or OOBD-Cup v5 */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(GPIOC, &GPIO_InitStructure);
		GPIO_SetBits(GPIOC, GPIO_Pin_13); /* default PC13: Release BT-Module from reset */
	} else if (GPIO_HardwareLevel() == 5) { /* OOBD CAN Invader */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
		GPIO_SetBits(GPIOA, GPIO_Pin_15); /* default PC13: Release BT-Module from reset */
	}

	/* CAN configuration depending on hardware ident */
	/* GPIO clock enable */
	if (GPIO_HardwareLevel() == 5) { /* OOBD CAN Invader */
		GPIO_PinRemapConfig(GPIO_Remap1_CAN1, DISABLE);
		GPIO_PinRemapConfig(GPIO_Remap2_CAN1, DISABLE);
		/* Configure CAN pin: RX */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
		/* Configure CAN pin: TX */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
	} else { /* DXM1 or OOBD-Cup v5 */
		GPIO_PinRemapConfig(GPIO_Remap1_CAN1, ENABLE);
		/* Configure CAN pin: RX */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		/* Configure CAN pin: TX */
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
	}
	/* CAN1 Periph clock enable */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);

	/* Identify on which hardware the firmware is running */
	if (GPIO_HardwareLevel() == 4) { /* OOBD-Cup v5 */
		/* TIM2 clock enable */
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
		/* configure PB11 PWM output for buzzer, TIM2_CH4 source for OOBD-Cup v5 */
		GPIO_PinRemapConfig(GPIO_PartialRemap2_TIM2, ENABLE); /* OOBD-Cup v5, use TIM2, Ch3 */
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
		GPIO_Init(GPIOB, &GPIO_InitStructure);
	} else if (GPIO_HardwareLevel() == 5) { /* OOBD CAN Invader */
		/* TIM3 clock enable */
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
		/* configure PA6 PWM output for buzzer, TIM3_CH1 source for OOBD CAN Invader */
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
		GPIO_Init(GPIOA, &GPIO_InitStructure);
	}
}

/*----------------------------------------------------------------------------*/

/**
 * @brief  Configures the different GPIO ports
 * @param  None
 * @retval None
 */
void USART1_Configuration(void) {

	volatile unsigned long nCount, nLength = 300000;

	USART_InitTypeDef USART_InitStructure;

	uint8_t BTM222_UartAutobaudControl;

	extern uint8_t BTM222_BtAddress[];

	USART_DeInit(USART1); /* Reset Uart to default */

	/** USARTx configuration -----------------------------------------------------
	 * USARTx configured as follow:
	 *      - BaudRate = 115200 baud
	 *      - Word Length = 8 Bits
	 *      - One Stop Bit
	 *      - None parity
	 *      - Hardware flow control disabled (RTS and CTS signals)
	 *      - Receive and transmit enabled
	 */
	USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_DEFAULT;

	USART_InitStructure.USART_WordLength = USART_WordLength_8b;

	USART_InitStructure.USART_StopBits = USART_StopBits_1;

	USART_InitStructure.USART_Parity = USART_Parity_No;

	USART_InitStructure.USART_HardwareFlowControl
			= USART_HardwareFlowControl_None;

