stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	/* Configure USART1 */
	USART_Init(USART1, &USART_InitStructure);

	/* Enable the USART1 */
	USART_Cmd(USART1, ENABLE);

	/* Enable the USART1-Transmit interrupt: this interrupt is generated when the
	 USART1 transmit data register is empty */
	/* USART_ITConfig(USART1, USART_IT_TXE, ENABLE); */

	/* Enable the USART1-Receive interrupt: this interrupt is generated when the
	 USART1 receive data register is not empty */
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);

	NVIC_Configuration();

	/* set UartAutobaudControl to default UART value 115200kbit/s */
	BTM222_UartAutobaudControl = 0;

	USART_SendData(USART1, '\r'); /* clear command line from Bootloader String first */
	delay_ms(1500); /* delay for waiting of BTM182/BTM222 power up - 1500ms */

	while (BTM222_UartAutobaudControl != 9) {
		USART_SendData(USART1, 'a');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 't');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '\r');
		btm_uart_delay_ms(100);

		BufCnt = 0; /* set BTM222_RespBuffer back to zero */
		BTM222_UART_Rx_Flag = pdFALSE;

		USART_SendData(USART1, 'a');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 't');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'q');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '?');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '\r');
		btm_uart_delay_ms(100);

		BufCnt = 0; /* set BTM222_RespBuffer back to zero */
		BTM222_UART_Rx_Flag = pdFALSE;

		USART_SendData(USART1, 'a');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 't');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'l');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '?');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '\r');
		btm_uart_delay_ms(100);

		/* check received response character from BTM222 */
		switch (BTM222_UartSpeed) {

		case '0':
			DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 4800bps detected! ***");

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;
			break;

		case '1':

			DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 9600bps detected! ***");

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;
			break;

		case '2':

			DEBUGUARTPRINT("\r\n*** BTM222 - L2 = 19200bps detected! ***");

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;

			break;

		case '3':

			DEBUGUARTPRINT("\r\n*** BTM222 - L3 = 38400bps detected! ***");

//			BTM222_UART_Rx_Flag = pdFALSE;

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;

//			BTM222_UART_Rx_Flag = pdTRUE;

			break;

		case '4':

			DEBUGUARTPRINT("\r\n*** BTM222 - L4 = 57600bps detected! ***");

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;

			break;

		case '5':

			DEBUGUARTPRINT
			("\r\n*** BTM222 - L5 = 115200bps detected! ***");

			BTM222_UartAutobaudControl = 9;

			break;

		case '6':

			DEBUGUARTPRINT
			("\r\n*** BTM222 - L6 = 230400bps detected! ***");

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;

			break;

		case '7':

			DEBUGUARTPRINT
			("\r\n*** BTM222 - L7 = 460800bps detected! ***");

			btm_uart_speed('5'); /* set BT-Module UART to default 115200 bit/s */

			BTM222_UartAutobaudControl = 6;

			break;

		default:

			DEBUGUARTPRINT("\r\n*** BTM222 - baudrate not detected! ***");

			BTM222_UartAutobaudControl++; /* increment AutobaudControl counter */

			break;

		}

		switch (BTM222_UartAutobaudControl) {

		case 1:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_4800;

			break;

		case 2:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_9600;

			break;

		case 3:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_19200;

			break;

		case 4:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_38400;

			break;

		case 5:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_57600;

			break;

		case 6:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_115200;

			break;

		case 7:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_230400;

			break;

		case 8:

			/* Initialize USART1 with next possible baudrate of BTM222 */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_460800;

			break;

		case 9:

			/* fallback to default baudrate */
			USART_InitStructure.USART_BaudRate = USART1_BAUDRATE_DEFAULT;

			break;

		default:

			break;

		}

		USART_Init(USART1, &USART_InitStructure); /* reinitialization of USART */

	} /* end of for */

	DEBUGUARTPRINT("\r\n*** Autobaud SCAN for BTM222 finished! ***");

	DEBUGUARTPRINT("\r\n*** Starting to get BTM222 BT address! ***");

	USART_SendData(USART1, '\r');
	btm_uart_delay_ms(40);

	BufCnt = 0; /* set BTM222_RespBuffer back to zero */
	BTM222_UART_Rx_Flag = pdFALSE;

	/* send "atb?"-command to get Bluetooth MAC address of BTM222 */
	USART_SendData(USART1, 'a');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, 't');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, 'b');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, '?');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, '\r');
	btm_uart_delay_ms(100);

//	BTM222_UART_Rx_Flag = pdTRUE;

	DEBUGUARTPRINT("\r\n*** Get BTM222 BT address finished! ***");

	DEBUGUARTPRINT("\r\n*** Get BTM222 BT device name! ***");

	BufCnt = 0; /* set BTM222_RespBuffer back to zero */
	BTM222_UART_Rx_Flag = pdFALSE;

	/* send "atn?"-command to get BTM222 device name */
	USART_SendData(USART1, 'a');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, 't');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, 'n');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, '?');
	btm_uart_delay_ms(40);
	USART_SendData(USART1, '\r');
	btm_uart_delay_ms(100);

	DEBUGUARTPRINT("\r\n*** Get BTM222 BT device name finished! ***");

	/* set "OOBD-Cup" as BTM222 Bluetooth device name if needed */
	if (BTM222_DeviceNameFlag == pdFALSE) {

