stko/oobd/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
		BufCnt = 0; /* set BTM222_RespBuffer back to zero */
		BTM222_UART_Rx_Flag = pdFALSE;

		USART_SendData(USART1, 'a');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 't');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'n');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '=');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'O');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'O');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'B');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'D');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '-');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'C');
		btm_uart_delay_ms(40);
		if (GPIO_HardwareLevel() == 4 || GPIO_HardwareLevel() == 1)
			USART_SendData(USART1, 'u');
		else if (GPIO_HardwareLevel() == 5)
			USART_SendData(USART1, 'I');

		btm_uart_delay_ms(40);
		if (GPIO_HardwareLevel() == 4 || GPIO_HardwareLevel() == 1)
			USART_SendData(USART1, 'p');
		else if (GPIO_HardwareLevel() == 5)
			USART_SendData(USART1, 'V');

		btm_uart_delay_ms(40);
		USART_SendData(USART1, ' ');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, BTM222_BtAddress[9]);
		btm_uart_delay_ms(40);
		USART_SendData(USART1, BTM222_BtAddress[10]);
		btm_uart_delay_ms(40);
		USART_SendData(USART1, BTM222_BtAddress[12]);
		btm_uart_delay_ms(40);
		USART_SendData(USART1, BTM222_BtAddress[13]);
		btm_uart_delay_ms(40);
		USART_SendData(USART1, BTM222_BtAddress[15]);
		btm_uart_delay_ms(40);
		USART_SendData(USART1, BTM222_BtAddress[16]);
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '\r');
		btm_uart_delay_ms(100);
		DEBUGUARTPRINT("\r\n*** BTM222 device name set to 'OOBD-Cup' ***");

		BufCnt = 0; /* set BTM222_RespBuffer back to zero */
		BTM222_UART_Rx_Flag = pdFALSE;

		/* send "atn?"-command to get BTM222 device name */
		USART_SendData(USART1, 'a');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 't');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, 'n');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '?');
		btm_uart_delay_ms(40);
		USART_SendData(USART1, '\r');
		btm_uart_delay_ms(100);

	}

	/* activate normal UART IRQ input stream handling */
	BTM222_UART_Rx_Flag = pdTRUE;
}

/*----------------------------------------------------------------------------*/

/**
 * @brief  Configures the different GPIO ports
 * @param  None
 * @retval None
 */
void USART2_Configuration(void) {

	USART_InitTypeDef USART_InitStructure;

	USART_DeInit(USART2); /* Reset Uart to default */

	/** USARTx configuration -----------------------------------------------------
	 * USARTx configured as follow:
	 *      - BaudRate = 10400 baud
	 *      - Word Length = 8 Bits
	 *      - One Stop Bit
	 *      - None parity
	 *      - Hardware flow control disabled (RTS and CTS signals)
	 *      - Receive and transmit enabled
	 */
	USART_InitStructure.USART_BaudRate = 10400;

	USART_InitStructure.USART_WordLength = USART_WordLength_8b;

	USART_InitStructure.USART_StopBits = USART_StopBits_1;

	USART_InitStructure.USART_Parity = USART_Parity_No;

	USART_InitStructure.USART_HardwareFlowControl
			= USART_HardwareFlowControl_None;

	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	/* Configure USART2 */
	USART_Init(USART2, &USART_InitStructure);

	/* Enable the USART2 */
	USART_Cmd(USART2, ENABLE);

	/* Enable the USART2-Transmit interrupt: this interrupt is generated when the
	 USART1 transmit data register is empty */
	/* USART_ITConfig(USART2, USART_IT_TXE, ENABLE); */

	/* Enable the USART2-Receive interrupt: this interrupt is generated when the
	 USART2 receive data register is not empty */
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);

	NVIC_Configuration();

}

/**
 * @brief  Configures the different GPIO ports
 * @param  None
 * @retval None
 */
void CAN1_Configuration(uint8_t CAN_BusConfig, uint8_t CAN_ModeConfig) {

	DEBUGUARTPRINT("\r\n*** CANx_Configuration (CAN1) entered! ***");

	CAN_InitTypeDef CAN_InitStructure;

	/* CAN register init */
	CAN_DeInit(CAN1);

	CAN_StructInit(&CAN_InitStructure);

	/* CAN cell init */
	CAN_InitStructure.CAN_TTCM = DISABLE; /* Time triggered communication mode */

	CAN_InitStructure.CAN_ABOM = DISABLE; /* Automatic bus-off management */

	CAN_InitStructure.CAN_AWUM = DISABLE; /* Automatic wakeup mode */

	CAN_InitStructure.CAN_NART = DISABLE; /* No automatic retransmission */

	CAN_InitStructure.CAN_RFLM = DISABLE; /* Receive FIFO locked mode */

	CAN_InitStructure.CAN_TXFP = ENABLE; /* Transmit FIFO priority */

	/* CAN_Mode_Normal, CAN_Mode_LoopBack, CAN_Mode_Silent, CAN_Mode_Silent_LoopBack */
	//  CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
	CAN_InitStructure.CAN_Mode = CAN_ModeConfig;

	CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;

	if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_125kbit || CAN_BusConfig
			== VALUE_BUS_CONFIG_29bit_125kbit) {

		CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;

		CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;

		CAN_InitStructure.CAN_Prescaler = 32; /* BRP Baudrate prescaler */

	}

	else if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_250kbit || CAN_BusConfig
			== VALUE_BUS_CONFIG_29bit_250kbit) {

		CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;

		CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;

		CAN_InitStructure.CAN_Prescaler = 16; /* BRP Baudrate prescaler */

	}

	else if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_500kbit || CAN_BusConfig
			== VALUE_BUS_CONFIG_29bit_500kbit) {

		CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;

		CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;

		CAN_InitStructure.CAN_Prescaler = 8; /* BRP Baudrate prescaler */

	}

	else if (CAN_BusConfig == VALUE_BUS_CONFIG_11bit_1000kbit || CAN_BusConfig
			== VALUE_BUS_CONFIG_29bit_1000kbit) {

		CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;

		CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;

		CAN_InitStructure.CAN_Prescaler = 4; /* BRP Baudrate prescaler */

	}

	else {

		/* default CAN bus speed is set to 500kbaud */
		CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;

		CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;

		CAN_InitStructure.CAN_Prescaler = 8; /* BRP Baudrate prescaler */

